{"id":974,"date":"2020-12-19T08:56:23","date_gmt":"2020-12-19T08:56:23","guid":{"rendered":"https:\/\/vedascure.in\/?p=974"},"modified":"2021-07-27T09:37:55","modified_gmt":"2021-07-27T09:37:55","slug":"apples-are-beneficial-in-diabetes","status":"publish","type":"post","link":"https:\/\/vedascure.in\/apples-are-beneficial-in-diabetes\/","title":{"rendered":"Apples are beneficial in Diabetes"},"content":{"rendered":"\n<h2>Apples are beneficial in Diabetes<\/h2>\n\n\n\n<p>Apple are very effective in the treatment of diabetes. Apples contain a rich, natural therapeutic substance called pectin. There is pectin present in the&nbsp; inner areas of the rind and the pulp of the apples. This is very effective in detoxification of the body. Basically pectin is a type of fiber found in the inner portion of the apples. It releases a kind of acid called galacturonic acid. This acid is&nbsp; beneficial for elimination of some harmful substances. Thus apples are beneficial in diabetes.<\/p>\n\n\n\n<p>An apple is low in calories and contains high fiber and for this reason it fills the stomach without increasing blood sugar levels.<br>In some researches, it has been found that apples have&nbsp; &nbsp;anti-diabetic characteristics.&nbsp; People even&nbsp; identified as pre-diabetics have stopped developing diabetes after taking apples regularly.<br>Due to its rich source of fiber apples provide approximately 20-25% of the fiber requirements in the body. It releases the sugar very slowly and gives energy for a longer period.<\/p>\n\n\n\n<p>In various research studies it has been found that apples are good for heart patients. It and keeps the digestive track balanced. The nutritional composition of apples is very rich in vitamins, minerals, carbohydrates and amino acids etc. Apples are also very good source of vitamin B-Complex.<\/p>\n\n\n\n<p>Apple contains a kind of antioxidant known as ‘quercetin’ which is very essential for neurological health. It reduces the risk of inflammation of neurons. It brings down the level of bad cholesterol and reduces the risk of stroke. One must take an apple daily for a healthier heart. It detoxifies the liver and boosts the immune system of the body. It is effective in diarrhea and constipation also. So we at<a href=\"http:\/\/vedas.antiagingcream.in\/shop\/vedas-diabetes-solution\/\" target=\"_blank\" rel=\"noopener\">&nbsp;Vedas Cure<\/a>&nbsp;advise the “Take an apple a day and keep the diseases away”.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Apples are beneficial in Diabetes Apple are very effective in the treatment of diabetes. Apples contain a rich, natural therapeutic substance called pectin. There is pectin present in the&nbsp; inner areas of the rind and the pulp of the apples. This is very effective in detoxification of the body. Basically pectin is a type of [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":975,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"off","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/vedascure.in\/wp-json\/wp\/v2\/posts\/974"}],"collection":[{"href":"https:\/\/vedascure.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/vedascure.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/vedascure.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/vedascure.in\/wp-json\/wp\/v2\/comments?post=974"}],"version-history":[{"count":0,"href":"https:\/\/vedascure.in\/wp-json\/wp\/v2\/posts\/974\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/vedascure.in\/wp-json\/wp\/v2\/media\/975"}],"wp:attachment":[{"href":"https:\/\/vedascure.in\/wp-json\/wp\/v2\/media?parent=974"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/vedascure.in\/wp-json\/wp\/v2\/categories?post=974"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/vedascure.in\/wp-json\/wp\/v2\/tags?post=974"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}